# WK 10 HW

## By Eli Weiss

### Part I: Data Cleaning

In [102]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/enwweiss/DAV-5400/master/Week10HWFile.csv")
df

  Unnamed: 0 Unnamed: 1     LA  Phoenix  San Diago  SanFran  Seattle
0     Alaska     ontime  497.0    221.0      212.0    503.0   1841.0
1        NaN    delayed   62.0     12.0       20.0    102.0    305.0
2        NaN        NaN    NaN      NaN        NaN      NaN      NaN
3     AMWEST     ontime  694.0   4840.0      383.0    320.0    201.0
4        NaN    delayed  117.0    415.0       65.0    129.0     61.0

In [103]:
#remove line 2 since it is just Nan's
df = df.drop(df.index[2])

In [104]:
#Rename Col 0 and 1
df.rename(columns={'Unnamed: 0':'Airline', 'Unnamed: 1':'Status'}, inplace=True)
df

  Airline   Status     LA  Phoenix  San Diago  SanFran  Seattle
0  Alaska   ontime  497.0    221.0      212.0    503.0   1841.0
1     NaN  delayed   62.0     12.0       20.0    102.0    305.0
3  AMWEST   ontime  694.0   4840.0      383.0    320.0    201.0
4     NaN  delayed  117.0    415.0       65.0    129.0     61.0

In [105]:
#Fill in NaN's with the value from the cell above it
df['Airline'].fillna(method='ffill', inplace = True)
df

  Airline   Status     LA  Phoenix  San Diago  SanFran  Seattle
0  Alaska   ontime  497.0    221.0      212.0    503.0   1841.0
1  Alaska  delayed   62.0     12.0       20.0    102.0    305.0
3  AMWEST   ontime  694.0   4840.0      383.0    320.0    201.0
4  AMWEST  delayed  117.0    415.0       65.0    129.0     61.0

### Part II: Analysis

Best On time Preformance by City

In [149]:
#This will choose the Airline that has the highest value for 'Ontime' for each city
print('LA:        ', df.Airline[df.LA == df.LA[df.Status == 'ontime'].max()])
print('Phoenix:   ',df.Airline[df.Phoenix == df.Phoenix[df.Status == 'ontime'].max()])
print('San Diago: ',  df.Airline[df['San Diago'] == df['San Diago'][df.Status == 'ontime'].max()])
print('San Fran:  ',df.Airline[df.SanFran == df.SanFran[df.Status == 'ontime'].max()])
print('Seattle:   ',df.Airline[df.Seattle == df.Seattle[df.Status == 'ontime'].max()])

LA:         3    AMWEST
Name: Airline, dtype: object
Phoenix:    3    AMWEST
Name: Airline, dtype: object
San Diago:  3    AMWEST
Name: Airline, dtype: object
San Fran:   0    Alaska
Name: Airline, dtype: object
Seattle:    0    Alaska
Name: Airline, dtype: object

Best Overall Median Preformance

In [194]:
#This returns the median for ontime and delayed for all cites for each airline 
print('Alaska Ontime Overall: ', df.iloc[0,2:].median())
print('Alaska Delayed Overall: ', df.iloc[1,2:].median())
print('AMWEST Ontime Overall: ', df.iloc[2,2:].median())
print('AMWEST Delayed Overall: ', df.iloc[3,2:].median())

Alaska Ontime Overall:  497.0
Alaska Delayed Overall:  62.0
AMWEST Ontime Overall:  383.0
AMWEST Delayed Overall:  117.0

Best Overall Perfomance By Magnitude

In [193]:
#This returns the sum for ontime and delayed for all cites for each airline 
print('Alaska Ontime Overall: ', sum(df.iloc[0,2:]))
print('Alaska Delayed Overall: ', sum(df.iloc[1,2:]))
print('AMWEST Ontime Overall: ', sum(df.iloc[2,2:]))
print('AMWEST Delayed Overall: ', sum(df.iloc[3,2:]))

Alaska Ontime Overall:  3274.0
Alaska Delayed Overall:  501.0
AMWEST Ontime Overall:  6438.0
AMWEST Delayed Overall:  787.0

## Part III: Making a Wide Data Set

Sometimes it is easier to understand a data set if is formatted in a "Wide" format.<br/> I think specifically this data set would be more readable if we gave it a hierarchical index for users to read.

In [206]:
# create a data frame with hierarchical indices on both axes
frame = pd.DataFrame(df.iloc[:,2:],index=[['Alaska', 'Alaska', 'AMWEST', 'AMWEST'], ['ontime', 'delayed', 'ontime', 'delayed']])
frame

                LA  Phoenix  San Diago  SanFran  Seattle
Alaska ontime  NaN      NaN        NaN      NaN      NaN
       delayed NaN      NaN        NaN      NaN      NaN
AMWEST ontime  NaN      NaN        NaN      NaN      NaN
       delayed NaN      NaN        NaN      NaN      NaN

In [213]:
#Populate the table with the data from the orginal table
frame.LA = list(df.LA)
frame.Phoenix = list(df.Phoenix)
frame['San Diago'] = list(df['San Diago'])
frame.SanFran = list(df.SanFran)
frame.Seattle = list(df.Seattle)

                   LA  Phoenix  San Diago  SanFran  Seattle
Alaska ontime   497.0    221.0      212.0    503.0   1841.0
       delayed   62.0     12.0       20.0    102.0    305.0
AMWEST ontime   694.0   4840.0      383.0    320.0    201.0
       delayed  117.0    415.0       65.0    129.0     61.0